// ---1---
// Перепишіть функцію, використовуючи '?' або '||'
// function checkAge(age) {
//     age > 18 ? true : confirm('Батьки дозволили?');
// }

// checkAge(16);




// ---2---
// Напишіть функцію min(a, b), яка повертає менше з двох чисел a та b.

// function min(a, b) {
//     if (a < b) {
//         return console.log(a);
//     }
//     return console.log(b);
// }

// min(9, 8);


// ---3---
// Перепишіть з використанням стрілкових функцій
// Замініть Функціональні Вирази на стрілкові функції у коді нижче:
// let ask = (question, yes, no) => (confirm(question)) ? yes() : no();

// ask(
// "Ви згодні?",
// function() { alert("Ви погодились."); },
// function() { alert("Ви скасували виконання."); }
// );